# SLU1 - Pandas 101: Learning notebook

In this notebook we will be covering the following:

- What is Pandas
- Series
- Dataframes
- Previewing a dataframe
- Columns
- Shape
- Reading data from disk
- Writing data to disk
- Info
- Describe

## What is pandas?

Pandas is a major tool of interest. It contains data structures and data manipulation tools designed to make data cleaning and analysis fast and easy in Python.

In this notebook the most basic functionalities will be covered.

### How do I call it?

In [1]:
import pandas as pd

Notice that we import pandas as "pd". This is not required, but it's standard.

### Pandas Data Structures

There are two main data structures on pandas:
- **Series** - A One-dimensional array of data of the same type. More documentation on Series is available on: [Pandas Series Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)

![Pandas Series](assets/serie.png "Pandas Series")

- **Dataframes** - Tabular structure that may be seen as a container of series (that may have different types).Be aware that is also possible to have one-dimensional array of data as a DataFrame. More documentation on Dataframes is available on: [Pandas Dataframes Documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html)

![Pandas DataFrame](assets/dataframe.PNG "Pandas Dataframe")

---

## Series

Creating a series in pandas is really easy. We will start by creating a series of numbers and print it to see how it look likes.

[Pandas Series Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)

In [9]:
s1 = pd.Series([10, 3, 5, 1, 12])
s1

0    10
1     3
2     5
3     1
4    12
dtype: int64

We can see that the values we have defined as data, with a given index (from 0 to the length of the data minus 1). Notice as well that the series has one and only one type of data, in this case `int64`. Pandas is quite clever inferring what kind of data is passed to it. Additonally it's possible to observe that the order of the data has been maintained.

Let's see what would have happened if we had passed it some floats, instead of ints:

In [3]:
s2 = pd.Series([0.5, 0.2, 5.2, 1.6, -0.6])
s2

0    0.5
1    0.2
2    5.2
3    1.6
4   -0.6
dtype: float64

Ok, so now it's a `float64` series.

Next up, the same, but this time with some strings:

In [10]:
s3 = pd.Series(["Google", "Microsoft", "Facebook", "Apple"])
s3

0       Google
1    Microsoft
2     Facebook
3        Apple
dtype: object

Ok, this time it was considered `object`. Objects are types of data that can point to different types of data as we may see in the example below.

Fair question: what happens if you pass it a mix of stuff?

In [5]:
s4 = pd.Series([1, 2.3, "omg a string", 2])
s4

0               1
1             2.3
2    omg a string
3               2
dtype: object

Well, when everything is mixed, it makes it an object!

Series have a class attribute that shows us their data type. It's called dtype and can be used like this:

In [6]:
s1.dtype

dtype('int64')

In [7]:
s4.dtype

dtype('O')

Note that series `s1` have the dtype integer and `s4` have the dtype object.

# Indexing

You will have noticed that our Series so far have a bunch of numbers on the left _(0, 1, 2, 3...)_. 

Those values represent the index, which is used for (among other things) selecting. 

Even though by default the index is _0, 1, 2, 3..._ it is often useful to set a different index. 

Here is an example:

In [8]:
s5 = pd.Series(data=["Larry", "Bill", "Mark", "Steve"], 
               index=["Google", "Microsoft", "Facebook", "Apple"])
s5

Google       Larry
Microsoft     Bill
Facebook      Mark
Apple        Steve
dtype: object

We wanted `Bill` to have the index `Microsoft`. Now we can actually treat this a bit like a dictionary:

In [9]:
s5['Microsoft']

'Bill'

We can also get all the values (still a bit like a dictionary):

In [10]:
s5.values

array(['Larry', 'Bill', 'Mark', 'Steve'], dtype=object)

Or the indexes (like the `.keys()` of the dictionary)

In [11]:
s5.index

Index(['Google', 'Microsoft', 'Facebook', 'Apple'], dtype='object')

Speaking of dictionaries, can I make a Pandas Series from a dictionary?

In [11]:
my_dict = {"Google": "Larry",
           "Microsoft": "Bill",
           "Facebook": "Mark",
           "Apple": "Steve"}

s6 = pd.Series(my_dict)
s6

Google       Larry
Microsoft     Bill
Facebook      Mark
Apple        Steve
dtype: object

The Series class will automatically use the keys of the dictionary as indexes of the series and its correponding data as the data of the series as well. The interesting part of using this is that we now are able to have some functionalities that we usually don't have in dictionaries.

In [13]:
try:
    my_dict[-1:]
    
except:
    print("Illegal operation")

Illegal operation

In [14]:
s5[-1:]

Apple    Steve
dtype: object

In the latest version of pandas, instead of using the method `.values` they recommend to use one of the following depending on whether you need a reference to the underlying data or a NumPy array, respectively: `.array` and `.to_numpy`.
The reason for that is that `.values` sometimes gives you an numpy array and other times it gives you an ExtensionArray and with the new methods there is a clear understanding to which you want to return.

If you use the method `.array` in the series `s5`, you get a 'PandasArray' as you can see (this method work for Serie and Index).

In [15]:
s5.array

<PandasArray>
['Larry', 'Bill', 'Mark', 'Steve']
Length: 4, dtype: object

In [16]:
s5.index.array

<PandasArray>
['Google', 'Microsoft', 'Facebook', 'Apple']
Length: 4, dtype: object

If you have a different type of data, like `period`, when you use the `.array` method, you get a 'PeriodArray'.

In [17]:
s6 = pd.period_range('2000', periods=4)

In [18]:
s6.array

<PeriodArray>
['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04']
Length: 4, dtype: period[D]

If you need an actual numpy array, you can do:

In [19]:
s5.to_numpy()

array(['Larry', 'Bill', 'Mark', 'Steve'], dtype=object)

In [20]:
s5.index.to_numpy()

array(['Google', 'Microsoft', 'Facebook', 'Apple'], dtype=object)

#### Key points:

- Each series has only one data type (even if it is a more inclusive one, like object).
- A list of indexes might be used (it has to have the same dimension).
- It is possible to use dictionaries to create series.
- There is a various methods to use to get info from a Series.

---

## DataFrames

As mentioned previously, a dataframe is a tabular structure (think "Excel sheet"). This will become clear with the following examples.

[Pandas Dataframes Documentantion](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html)

Let's make our first DataFrame:

In [4]:
df1 = pd.DataFrame([10,122,1])

In [7]:
df1

     0
0   10
1  122
2    1

This first dataframe is a really simple one. We can see that in this case we have columns and indexes. This shows the tabular structure. But the next case will highlight this even further.

In [13]:
df2 = pd.DataFrame([[1,   2,   3,    7],  # ignore the weird spacing, it's just to be clear we have 3 lists of 4 
                    [4.2, 6.1, 8.9, -4.1], 
                    ["a", "b", "c", "z"] ])

In [15]:
df2

     0    1    2    3
0    1    2    3    7
1  4.2  6.1  8.9 -4.1
2    a    b    c    z

Notice that the way this dataframe is being created leads to a row of values for each list of data provided. It is also possible to provide a list of names for each of the columns...

In [25]:
df3 = pd.DataFrame([[1,   2,   3,    7], 
                    [4.2, 6.1, 8.9, -4.1], 
                    ["a", "b", "c", "z"] ],
                    columns=["col_1", "col_2", "col_3", "col_4"])   # <-- The column names!

In [26]:
df3

  col_1 col_2 col_3 col_4
0     1     2     3     7
1   4.2   6.1   8.9  -4.1
2     a     b     c     z

as well for each of the rows.

In [27]:
df4 = pd.DataFrame([[1,   2,   3,    7], 
                    [4.2, 6.1, 8.9, -4.1], 
                    ["a", "b", "c", "z"] ],
                    columns=["col_1", "col_2", "col_3", "col_4"],  # <-- The column names
                    index=["row_1", "row_2", "row_3"])   # <-- The row names

In [28]:
df4

      col_1 col_2 col_3 col_4
row_1     1     2     3     7
row_2   4.2   6.1   8.9  -4.1
row_3     a     b     c     z

So far we've been creating DataFrames from lists, like so:

In [29]:
company = ["Google", "Microsoft", "Facebook", "Apple"]
founder_name = ["Larry", "Bill", "Mark", "Steve"]
founder_surname = ["Page", "Gates", "Zuckerberg", "Jobs"]

df5 = pd.DataFrame( [ company, founder_name, founder_surname])

In [30]:
df5

        0          1           2      3
0  Google  Microsoft    Facebook  Apple
1   Larry       Bill        Mark  Steve
2    Page      Gates  Zuckerberg   Jobs

But we can also do something cool, which is to make a dictionary with the lists as values, where the keys will be the column names. Let's create the dictionary first, using the lists we have defined above:

In [31]:
tech_companies_dictionary = {
    'company': ["Google", "Microsoft", "Facebook", "Apple"],
    'founder_name': ["Larry", "Bill", "Mark", "Steve"],
    'founder_surname': ["Page", "Gates", "Zuckerberg", "Jobs"],
}

This is super readable, right?

In [32]:
tech_companies_dictionary

{'company': ['Google', 'Microsoft', 'Facebook', 'Apple'],
 'founder_name': ['Larry', 'Bill', 'Mark', 'Steve'],
 'founder_surname': ['Page', 'Gates', 'Zuckerberg', 'Jobs']}

Now we can simply pass this to a Pandas DataFrame:

In [33]:
df6 = pd.DataFrame(tech_companies_dictionary)

In [34]:
df6

     company founder_name founder_surname
0     Google        Larry            Page
1  Microsoft         Bill           Gates
2   Facebook         Mark      Zuckerberg
3      Apple        Steve            Jobs

By passing a dictionary as input to the creation of the dataframe, the dataframe is now able to use the key of the dictionary as the name of the column and present the data along a column, instead of along a row. This is becoming closer to how information is usually presented.

----

# Putting it all together

Let's do the same thing again, using everything we've learned so far:

In [35]:
# Let's say we have these lists somewhere on our computer: 
founder_names = ["Larry", "Bill", "Mark", "Steve", "Larry", "Reed"]
founder_surnames = ["Page", "Gates", "Zuckerberg", "Jobs", "Ellison", "Hastings"]
company = ["Google", "Microsoft", "Facebook", "Apple", "Oracle", "Netflix"]

Let's make some Series, using the company name as index:

In [36]:
series_of_founder_names = pd.Series(data=founder_names, # <-- data 
                                    index=company)      # <-- index

In [37]:
series_of_founder_names

Google       Larry
Microsoft     Bill
Facebook      Mark
Apple        Steve
Oracle       Larry
Netflix       Reed
dtype: object

Same thing, this time for surnames:

In [38]:
series_of_founder_surnames = pd.Series(data=founder_surnames, # <-- different data
                                    index=company)        # <-- same index

In [39]:
series_of_founder_surnames

Google             Page
Microsoft         Gates
Facebook     Zuckerberg
Apple              Jobs
Oracle          Ellison
Netflix        Hastings
dtype: object

Now with these two Series we can create a dataframe! Pandas will notice that they have the same index, and will give the DataFrame that index:

In [40]:
df7 = pd.DataFrame({'founder_name': series_of_founder_names,  
                    'founder_surname': series_of_founder_surnames})

In [41]:
df7

          founder_name founder_surname
Google           Larry            Page
Microsoft         Bill           Gates
Facebook          Mark      Zuckerberg
Apple            Steve            Jobs
Oracle           Larry         Ellison
Netflix           Reed        Hastings

By passing series (in this case sharing the index) as values of a dictionary, the model is able to use the key value as column name and the index as the row name. The column and index(row) are also acessible, as will be shown below.

### What if my data isn't a Pandas Series?

It will often happen that you have a list or array:

In [42]:
number_of_employees = [73992, 124000, 20658, 123000, 138000, 5400]

In [43]:
series_of_number_employees = pd.Series(data=number_of_employees) # <-- data, no index

Now, you may be tempted to add this directly to the DataFrame, and Pandas won't stop you:

In [44]:
df8 = pd.DataFrame({'founder_name': series_of_founder_names,  
                    'founder_surname': series_of_founder_surnames,
                    'number_employees': series_of_number_employees})

In [45]:
df8

          founder_name founder_surname  number_employees
Google           Larry            Page             73992
Microsoft         Bill           Gates            124000
Facebook          Mark      Zuckerberg             20658
Apple            Steve            Jobs            123000
Oracle           Larry         Ellison            138000
Netflix           Reed        Hastings              5400

You should however notice that this is a **lot more dangerous**, as you are making the assumption that the rows are in the same order as the list.

In practice, you will probably end up doing this out of time contraints, or reading other people's code where lists are added directly without an index. But remember: if you have an index you are safer.

-----

### Getting the index and column values

This dataframe object contains some cool attributes, among which are the following:

Get index, with `.index`:

In [46]:
df8

          founder_name founder_surname  number_employees
Google           Larry            Page             73992
Microsoft         Bill           Gates            124000
Facebook          Mark      Zuckerberg             20658
Apple            Steve            Jobs            123000
Oracle           Larry         Ellison            138000
Netflix           Reed        Hastings              5400

In [47]:
df8.index

Index(['Google', 'Microsoft', 'Facebook', 'Apple', 'Oracle', 'Netflix'], dtype='object')

Get the columns, with `.columns`:

In [48]:
df8.columns

Index(['founder_name', 'founder_surname', 'number_employees'], dtype='object')

Among other things, this might be used to iterate over the column titles.

In [49]:
for col in df8.columns:
    print(col)

founder_name
founder_surname
number_employees

We can also use `dtypes` to know the type of each series of the dataframe:

In [50]:
df8.dtypes

founder_name        object
founder_surname     object
number_employees     int64
dtype: object

As mentioned above with Series, you also have the method `.values` in a dataframe, but it's probably better to start using the `.to_numpy` (performance timings!)

Note: DataFrame doesn't have the method `.array`

In [51]:
df8.to_numpy()

array([['Larry', 'Page', 73992],
       ['Bill', 'Gates', 124000],
       ['Mark', 'Zuckerberg', 20658],
       ['Steve', 'Jobs', 123000],
       ['Larry', 'Ellison', 138000],
       ['Reed', 'Hastings', 5400]], dtype=object)

#### Key points:

- DataFrames may be seen as a tabular structure (named rows and columns).
- We can define the indexes and columns as we create the dataframe.
- It's possible to take advantage of dictionaries and Series to create DataFrames.

---

## Previewing a DataFrame

#### Visualizing the DataFrame or part of it

To visualize a DataFrame, using a jupyter-notebook, printing will display it (as seen previously).

In [52]:
df8

          founder_name founder_surname  number_employees
Google           Larry            Page             73992
Microsoft         Bill           Gates            124000
Facebook          Mark      Zuckerberg             20658
Apple            Steve            Jobs            123000
Oracle           Larry         Ellison            138000
Netflix           Reed        Hastings              5400

In the case that the dataframe has a lot of entries, it will be only partially displayed. Nonetheless, it might still be too much information being displayed at once and the methods that are going to be used below often prove to be a better alternative. Namely, it is possible to print only a certain number of entries from the top or from the bottom using `.head` and `.tail`, respectively.

In [53]:
df8.head(n=2)

          founder_name founder_surname  number_employees
Google           Larry            Page             73992
Microsoft         Bill           Gates            124000

In [54]:
df8.tail(n=2)

        founder_name founder_surname  number_employees
Oracle         Larry         Ellison            138000
Netflix         Reed        Hastings              5400

---

## Retrieving DataFrame Information

#### Getting the relevant info

With pandas' [info](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.info.html) it possible to obtain:
- How many entries it has.
- The total number of columns.
- The title of each column.
- The number of entries that in fact exists in each column. Does not consider misssing values.
- The type of data of the entries of a given column.

In [55]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Google to Netflix
Data columns (total 3 columns):
founder_name        6 non-null object
founder_surname     6 non-null object
number_employees    6 non-null int64
dtypes: int64(1), object(2)
memory usage: 352.0+ bytes

For the **NUMERICAL** variables it's also possible to print some more information using [describe](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html), namely:

- The number of rows for each of those columns.
- The mean value.
- The standard deviation.
- The minimum and maximum value.
- The median, the 25th and 75th percentile.

In [56]:
df8.describe()

       number_employees
count          6.000000
mean       80841.666667
std        57039.422527
min         5400.000000
25%        33991.500000
50%        98496.000000
75%       123750.000000
max       138000.000000

Finally, [shape](https://pandas.pydata.org/pandas-docs/version/0.17.0/generated/pandas.DataFrame.shape.html) returns a tuple with the dimensions of the dataframe (nr_rows, nr_columns).

In [57]:
df8.shape

(6, 3)

### Key points:

- It's possible to print the dataframe (still shows too many lines, might be too "noisy").
- `head()` and `tail()` print the n top and bottom, respectively, lines of the dataframe.
- Info returns the number of entries, the number of columns, their counts and the data type.
- Describe returns basic statistical information of the numeric columns.

---

## Reading from the disk

Pandas framework has implemented functions that allow us to create dataframes form several different types of data:

- CSV
- JSON
- HTML
- ... and [many more](https://pandas.pydata.org/pandas-docs/stable/io.html)

All of this is possible by using the read_*dataFormat*. With it is possible to create a dataframe and apply all the previously shown techniques. 

For instance, using the 2010 census profile and housing characteristics of the city of Los Angeles ([source](https://catalog.data.gov/dataset/2010-census-populations-by-zip-code)):

In [58]:
data = pd.read_csv("data/2010_Census_Populations_by_Zip_Code.csv")

What does this look like?

In [59]:
data.head(5)

,Zip Code,Total Population,Median Age,Total Males,Total Females,Total Households,Average Household Size
0,91371,1,73.5,0,1,1,1.00
1,90001,57110,26.6,28468,28642,12971,4.40
2,90002,51223,25.5,24876,26347,11731,4.36
3,90003,66266,26.3,32631,33635,15642,4.22
4,90004,62180,34.8,31302,30878,22547,2.73

Let's use `info`:

In [60]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319 entries, 0 to 318
Data columns (total 7 columns):
Zip Code                  319 non-null int64
Total Population          319 non-null int64
Median Age                319 non-null float64
Total Males               319 non-null int64
Total Females             319 non-null int64
Total Households          319 non-null int64
Average Household Size    319 non-null float64
dtypes: float64(2), int64(5)
memory usage: 17.5 KB

Now for a fuller description:

In [61]:
data.describe()

,Zip Code,Total Population,Median Age,Total Males,Total Females,Total Households,Average Household Size
count,319.000000,319.000000,319.000000,319.000000,319.000000,319.000000,319.000000
mean,91000.673981,33241.341693,36.527586,16391.564263,16849.777429,10964.570533,2.828119
std,908.360203,21644.417455,8.692999,10747.495566,10934.986468,6270.646400,0.835658
min,90001.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,90243.500000,19318.500000,32.400000,9763.500000,9633.500000,6765.500000,2.435000
50%,90807.000000,31481.000000,37.100000,15283.000000,16202.000000,10968.000000,2.830000
75%,91417.000000,44978.000000,41.000000,22219.500000,22690.500000,14889.500000,3.320000
max,93591.000000,105549.000000,74.000000,52794.000000,53185.000000,31087.000000,4.670000

### Key points:

- Pandas allows the creation of dataframes from several structures of data.

----

## Writing to the disk

Besides reading from the disk, Pandas allows us to also write and save our dataframe after we performed some transformations to the data.

The same way we can read data from various data types, we can also write data to various data types (CSV, JSON, HTML, ...)

All of this is possible by using the to_*dataFormat*, giving as an argument the path where you want to save the file:

In [62]:
data.to_csv("data/new_csv.csv")

---

## To learn more (optional)

- [Intro to data structures](https://pandas.pydata.org/pandas-docs/stable/dsintro.html)